Description: Recipe description
Identifier: com.github.moofit-recipes.pkg.Reaper
Input:
  NAME: REAPER
  URL: https://www.reaper.fm/download.php

MinimumVersion: '2.3'
ParentRecipe: com.github.moofit-recipes.download.Reaper
Process:

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/root"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/REAPER.app"
      source_path: "%found_filename%/REAPER.app"

  - Processor: com.github.homebysix.VersionSplitter/VersionSplitter
    Arguments:
      version: "%version%"
      split_on: _

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundleid%"
        options: purge_ds_store
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/root"
        version: "%version%"
