Description: Recipe description
Identifier: com.github.moofit-recipes.pkg.FinalDraft12
Input:
  NAME: Final Draft 12
  URL: https://www.finaldraft.com/support/install-final-draft/install-final-draft-12-macintosh/

MinimumVersion: '2.3'
ParentRecipe: com.github.moofit-recipes.download.FinalDraft12
Process:

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/root"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/%NAME%/%NAME%.dmg"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/Final Draft 12.app"
      source_path: "%found_filename%/Final Draft 12.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundleid%"
        options: purge_ds_store
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/root"
        version: "%version%"
