Description: Downloads the current version of RODE Central as a package.
Identifier: com.github.moofit-recipes.pkg.RODECentral
ParentRecipe: com.github.moofit-recipes.download.RODECentral
MinimumVersion: "2.3"
Input:
  NAME: RODE Central
  DOWNLOAD_URL: https://update.rode.com/central/RODE_Central_MACOS.zip
Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%RECIPE_CACHE_DIR%/%NAME%.pkg"
      purge_destination: false
  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/RODE Central Installer.pkg/Payload"
  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/unpack/Applications/%NAME%.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/%NAME%.pkg"
