Description: Downloads the current version of RODE Central.
Identifier: com.github.moofit-recipes.download.RODECentral
MinimumVersion: "2.3"

Input:
  NAME: RODE Central

Process:

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: "https://update.rode.com/central/RODE_Central_MACOS.zip"
      url: "https://rode.com/en/software/rode-central"
      filename: "%NAME%.zip"

  - Processor: URLDownloader
    Arguments:
      url: "%match%"
      filename: "%NAME%.zip"

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_format: zip
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"
      purge_destination: True
    Comment: Unzipping for code signature verification. Path must be deleted afterwards to prevent unzipping over existing version.

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/unzip/R*DE Central*.pkg"

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/%NAME%.pkg"
      expected_authority_names:
       - "Developer ID Installer: FREEDMAN ELECTRONICS PTY LTD (Z9T72PWTJA)"
       - Developer ID Certification Authority
       - Apple Root CA
