<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Sigil and makes a package.</string>
	<key>Identifier</key>
	<string>com.github.moofit-recipes.pkg.Sigil</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Sigil</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
    <string>com.github.foigus.download.Sigil</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
