Description: Downloads the latest version of Azure Data Studio
Identifier: com.github.moofit-recipes.download.AzureDataStudio
MinimumVersion: '1.1.0'
Input:
    NAME: Azure Data Studio
    URL: https://github.com/microsoft/azuredatastudio/releases

Based on: com.github.dataJAR-recipes.download.AzureDataStudio

Process:

  - Processor: DeprecationWarning
    Arguments:
      warning_message: Consider switching to the AzureDataStudio recipes in the dataJAR-recipes repo. This recipe is deprecated and will be removed in the future.
  
  - Processor: URLTextSearcher
    Arguments:
      url: "%URL%"
      re_pattern: href=\"(https://go\.microsoft\.com/fwlink/\?linkid=[0-9]+)\" rel=\"nofollow\">Universal
      result_output_var_name: DOWNLOAD_URL

  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%"
      filename: "%NAME%.zip"

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%"
      purge_destination: True

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app"
      requirement: identifier "com.azuredatastudio.oss" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9
